:PROPERTIES:
:ID:       94914e18-51c7-47bf-984d-d200b9b70100:PROPERTIES:
:header-args+: :dir /tmp/tmp.wwUrMduc34
:END:
#+TITLE: Cheatsheet: Onshape
#+CATEGORY: slips
#+TAGS:

* Listing :noexport:

This is from =api/v12/keyboardshortcuts/users/:user/category=

#+begin_src jq :in-file onshapekeys.json
keys
#+end_src

#+RESULTS:
| 3D View | Assembly | Drawing | Feature Studio | General | Part Studio | Sketch |

#+name: keysByCategory
#+begin_src jq :in-file onshapekeys.json :var k="3D View"
to_entries
  | map(select(.key == $k) | .value)
  | first
#+end_src

#+name: formatKeys
#+begin_src jq :results table :stdin keysByCategory(k="3D View") :cmd-line --raw-output
def formatKey:
  sub("Key"; ""; "g")
  | sub("Digit"; ""; "g")
  | sub("Shift\\+"; "S-"; "g")
  | sub("Alt\\+"; "A-"; "g")
  | sub("Meta\\+"; "M-"; "g")
  | sub("Control\\+"; "C-"; "g")
  | sub("ArrowLeft"; "⬅")
  | sub("ArrowRight"; "➡")
  | sub("ArrowUp"; "⬆")
  | sub("ArrowDown"; "⬇");

def formatBind:
  [. | sub("(?<mods>.+)-.*"; "\(.mods)"; "l"),
   . | sub(".+-(?<k>.+)"; "\(.k)"; "l")]
  | join("|");

. | map([(.keySequence | map(formatKey) | join(" · ")),
      .action.name,
      (.action.scopes | map(.name) | sort | join(" "))])
  | sort_by(first)
#  | sort_by(nth(1))
       
#+end_src

